dot-emacs-dot-d.org
#+TITLE: =.emacs.d=
#+AUTHOR: Jacob MacDonald
#+PROPERTY: header-args :noweb yes :padline no

#+BEGIN_SRC text :tangle UNLICENSE
  This is free and unencumbered software released into the public domain.

  Anyone is free to copy, modify, publish, use, compile, sell, or distribute this
  software, either in source code form or as a compiled binary, for any purpose,
  commercial or non-commercial, and by any means.

  In jurisdictions that recognize copyright laws, the author or authors of this
  software dedicate any and all copyright interest in the software to the public
  domain. We make this dedication for the benefit of the public at large and to
  the detriment of our heirs and successors. We intend this dedication to be an
  overt act of relinquishment in perpetuity of all present and future rights to
  this software under copyright law.

  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
  AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
  ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION
  WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

  For more information, please refer to <http://unlicense.org/>
#+END_SRC

Emacs is by far the most important application I use to develop. It is also the
most fun to configure application I use, period. That means configuring it can
be a daunting task. This document is my attempt to create an Emacs setup that
is comprehensive and easy to extend. To this end, I've made it a literate Org
file, which means it is organized, easy to modify, and easily convertible to
web page. It is also version controlled.

Now, for some code.

* Bootstrap.

  To load various packages and initialize them succinctly, I use =quelpa= and
  =use-package=. =quelpa= builds packages from source so I can stay on the
  bleeding edge. =use-package= loads and initializes the packages in a compact
  and readable macro. Unfortunately, one cannot load those packages using
  them. Fortunately, the bootstrapping process is relatively painless.

  The =quelpa= bootstrap snippet comes straight from the project's GitHub
  page. I use the non-auto-updating version.

  #+BEGIN_SRC emacs-lisp :noweb-ref quelpa
    (package-initialize)
    (setf quelpa-update-melpa-p nil)
    (unless (require 'quelpa nil t)
      (with-temp-buffer
        (url-insert-file-contents
         "https://raw.github.com/quelpa/quelpa/master/bootstrap.el")
        (eval-buffer)))
  #+END_SRC

  Because of the last snippet, =use-package= can be downloaded using the
  =quelpa= function, but it must be loaded manually. (Manually being a
  one-liner. :-)

  #+BEGIN_SRC emacs-lisp :noweb-ref use-package
    (quelpa 'use-package)
    (require 'use-package)
  #+END_SRC

  After the actual boostrapping I can use a small convenience macro I wrote
  myself to combine =quelpa= and =use-package=. It is called =quse-package= and
  is fetched via (you guessed it) =quelpa=.

  #+BEGIN_SRC emacs-lisp :noweb-ref quse-package
    (quelpa '(quse-package :fetcher github :repo "jaccarmac/quse-package"))
    (require 'quse-package)
  #+END_SRC

* Improve Emacs' interface.

  Vanilla Emacs is usable, but not usable enough to allow me to be
  productive. A few small packages allow me to actually function in the editor.

  Phil Hagelberg's =better-defaults= is a good start, including several
  one-line configuration options and usability rebinds.

  #+BEGIN_SRC emacs-lisp :noweb-ref better-defaults
    (quse-package better-defaults)
  #+END_SRC

  Emacs recently changed the way it handles saving the position of the point in
  visited files. =better-defaults= uses the old way (setting a variable) while
  newer versions of Emacs use a mode for the same behavior. I'm almost ready to
  submit a pull request to =better-defaults=, but don't understand the nuts and
  bolts of the change completely. Thus, here is a monkey-patch to fix the
  behavior for myself.

  #+BEGIN_SRC emacs-lisp :noweb-ref save-place-mode
    (use-package saveplace :init
      (when (fboundp 'save-place-mode) (save-place-mode)))
  #+END_SRC

  And while =better-defaults= enables Ido mode and Ido flex matching, both of
  which are very useful settings, it does not enable Ido everyhwere, which is
  very useful. Fully converting Emacs to use Ido has to be done in several
  steps. First comes the basic Ido setup included in =better-defaults=. Then,
  ~ido-ubiquitous~, a slightly more dangerous built-in function, is
  activated. Finally, several more packages are used to fill in the
  gaps. Namely, they are =ido-ubiquitous= for a few edge cases, =smex= to
  replace the =M-x= prompt, =ido-yes-or-no= to replace binary prompts, and
  =crm-custom.el= to replace =completing-read-multiple=.

  #+BEGIN_SRC emacs-lisp :noweb-ref ido-really-everywhere
    (ido-everywhere)

    (quse-package ido-ubiquitous
                  :init
                  (ido-ubiquitous-mode)
                  (setf org-completion-use-ido t)
                  (setf magit-completing-read-function 'magit-ido-completing-read))

    (quse-package ido-yes-or-no :init (ido-yes-or-no-mode))

    (quse-package crm-custom :init (crm-custom-mode))

    (quse-package smex
                  :init (smex-initialize)
                  :bind (("M-x" . smex)
                         ("M-X" . smex-major-mode-commands)
                         ("C-c C-c M-x" . execute-extended-command)))
  #+END_SRC

  On top of the sensible settings in =better-defaults=, I like to set
  =fill-column= to a sane value that doesn't depend on Emacs' frame
  size.

  #+BEGIN_SRC emacs-lisp :noweb-ref fill-column
    (setq-default fill-column 79)
  #+END_SRC

  Unix UTF-8 encoding is a better sensible default for encoding than whatever
  platform-dependent value Emacs uses by default.

  #+BEGIN_SRC emacs-lisp :noweb-ref prefer-coding-system
    (prefer-coding-system 'utf-8-unix)
  #+END_SRC

  It's also nice to not have to deal with the splash screen every time Emacs
  starts.

  #+BEGIN_SRC emacs-lisp :noweb-ref inhibit-splash-screen
    (setq-default inhibit-splash-screen t)
  #+END_SRC

  Exposing Emacs' multi-branch undo and redo feature graphically is
  fantastically useful. Tony Cubitt's =undo-tree-mode= does just that.

  #+BEGIN_SRC emacs-lisp :noweb-ref undo-tree
    (quse-package undo-tree :init (global-undo-tree-mode))
  #+END_SRC

  Donald Ephraim Curtis had made a great port of Vim Powerline. It is helpful
  for keeping track of location in a file, and it looks pretty.

  #+BEGIN_SRC emacs-lisp :noweb-ref powerline
    (quse-package powerline :init (powerline-default-theme))
  #+END_SRC

  I have used many themes for Emacs during my time using it. I tend to come
  back to kuanyui's =moe-theme= due to its amount of contrast and variety of
  faces.

  #+BEGIN_SRC emacs-lisp :noweb-ref moe-theme
    (quse-package moe-theme :config (load-theme 'moe-dark t))
  #+END_SRC

  I also enjoy using a pleasant monospace font. It's pretty easy to get Emacs
  to recognize your global GTK settings on a Linux box, but for Windows
  machines the font needs to be set programmatically or in the
  registry. Explicitly using Iosevka works on all systems with the font
  installed, and defaults back to the font provided by the system if Iosevka
  isn't there.

  #+BEGIN_SRC emacs-lisp :noweb-ref face-attribute-font
    (set-face-attribute 'default nil :font "Iosevka")
  #+END_SRC

  The =smartparens= package is like =paredit= plus a bunch of nice extras. I
  enable the strict mode globally and use the maintainer's default keybindings.

  #+BEGIN_SRC emacs-lisp :noweb-ref smartparens
    (quse-package smartparens
                  :init
                  (smartparens-global-mode)
                  (smartparens-global-strict-mode)
                  (require 'smartparens-config)
                  (sp-use-smartparens-bindings))
  #+END_SRC

* Make copying in Dired marginally better.

  `dired-dwim-target` makes Dired Do What I Mean when copying. This means I can
  open two Dired windows in disparate locations and copy files between them
  without having to edit long pathnames.

  #+BEGIN_SRC emacs-lisp :noweb-ref dired-dwim-target
    (setf dired-dwim-target t)
  #+END_SRC

* Install a recent version of Org mode.

  It works fine without installing the bleeding edge, but that's no fun. And
  installing the bleeding edge is just too easy...

  Org mode is so awesome that I use it as my default mode.

  #+BEGIN_SRC emacs-lisp :noweb-ref org
    (quse-package (org :fetcher git
                       :url "git://orgmode.org/org-mode.git"
                       :files ("lisp/*.el"
                               "contrib/lisp/*.el"
                               "doc/dir"
                               "doc/*.texi"))
                  :init
                  (setf default-major-mode 'org-mode))
  #+END_SRC

** Create presentations in Org.

   Org comes preloaded with facilities for Beamer export, which produces
   high-quality LaTeX presentations. I prefer something lighter and webbier,
   and that thing is reveal.js, which also has an Org exporter. However, this
   one needs to be installed.

   #+BEGIN_SRC emacs-lisp :noweb-ref ox-reveal
     (quse-package ox-reveal)
   #+END_SRC

** Improve Org's LaTeX export.

   I end up writing a lot of papers in Org and exporting via LaTeX for nice
   PDFs. After a few months of doing this with a more-or-less vanilla Org
   setup, I've found that doing citations properly is difficult. That is the
   motivation for the changes below, which consist of:

   1. Setting the export process to =latexmk=.

      #+BEGIN_SRC emacs-lisp :noweb-ref org-pdf-latexmk
        (setf org-latex-pdf-process (list "latexmk -f -pdf %f"))
      #+END_SRC

*** Allow APA-style export from Org.

    To use document classes that aren't ~article~, ~report~, or ~book~, the
    class needs to be registered in Org. I took the samples from the existing
    ~org-latex-classes~ and added one for the LaTeX ~apa6~ package.

    #+BEGIN_SRC emacs-lisp :noweb-ref org-latex-classes-apa6
      (add-to-list 'org-latex-classes
                   '("apa6"
                     "\\documentclass[man,12pt]{apa6}"
                     ("\\section{%s}" . "\\section*{%s}")
                     ("\\subsection{%s}" . "\\subsection*{%s}")
                     ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                     ("\\paragraph{%s}" . "\\paragraph*{%s}")
                     ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
    #+END_SRC

* Manage my money.

  Ledger is a fantastic personal accounting application. It has a ton of
  features, but it relatively easy to configure in plain text. It comes with an
  Emacs mode.

  #+BEGIN_SRC emacs-lisp :noweb-ref ledger-mode
    (quse-package ledger-mode
                  :init (add-to-list 'auto-mode-alist
                                     '("ledger/.*\\.dat\\'" . ledger-mode)))
  #+END_SRC

* Generate and secure passwords.

  I use =password-store= to manage and generate all my passwords. This utility
  stores passwords in text files encrypted by my GPG key, and can copy them to
  the system clipboard when I need to use them. A work-in-progress Emacs mode
  is included in the distribution and cloned and installed in the following
  snippet.

  #+BEGIN_SRC emacs-lisp :noweb-ref password-store
    (quse-package password-store)
  #+END_SRC

