dot-emacs-dot-d.org
* Manage projects.

  One-off-file hacking is great, but most of what I do is done in the context
  of a project, often one too big to fit inside my head. The following packages
  integrate tools that do the legwork of project management with Emacs.

  Bozhidar Batsov's =projectile= is an all-inclusive project management
  navigator and indexer for Emacs. The indexing it does is especially useful,
  letting you grep an entire project with a simple key chord. I force the
  indexing to use fast Unix-y tools even on Windows. Even though this method is
  faster than using Emacs Lisp indexing, note that it requires extra tools,
  namely Git and =find=, to be installed.

  #+BEGIN_SRC emacs-lisp :noweb-ref projectile
    (quse-package projectile
                  :init
                  (projectile-global-mode)
                  (setf projectile-switch-project-action 'projectile-dired)
                  (setf projectile-indexing-method 'alien))
  #+END_SRC

  Git is the modern king of version control. The Magit project turns Emacs into
  an extremely powerful interface to it. I find that key chords are much more
  efficient than terminal commands after a few days' practice.

  #+BEGIN_SRC emacs-lisp :noweb-ref magit
    (quse-package magit)
  #+END_SRC

  Using SSH Git remotes on Windows is a nightmare due to how difficult it is to
  get ssh-agent's environment variables into an Emacs not started in Cygwin or
  MSYS. Thankfully, the Magit maintainers have written a package to manage said
  environment variables, just for Emacs, automatically!

  #+BEGIN_SRC emacs-lisp :noweb-ref ssh-agency
    (quse-package ssh-agency)
  #+END_SRC

* Complete symbols.

  It's nearly impossible to work with large projects or avoid misspellings
  without a good, always-accessible completion framework. The Emacs community
  is split between using Company and Auto-Complete. I've used Auto-Complete for
  quite a while and have no pressing reason to switch. Its initialization is
  rather simple; Sources are initialized later with the modes they are
  associated with.

  #+BEGIN_SRC emacs-lisp :noweb-ref auto-complete
    (quse-package auto-complete
                  :init
                  (require 'auto-complete-config)
                  (ac-config-default))
  #+END_SRC

* Clojure.

  Clojure is a fantastic Lisp that gives me access to the JVM without having to
  deal with Java.

  CIDER is, in my opinion, the best way to edit Clojure in Emacs, bar
  none. Loading is done in the standard quelpa way; The configuration options
  are taken from CIDER's GitHub page. I prefer Boot over Leiningen, so I set
  Boot as my default REPL.

  #+BEGIN_SRC emacs-lisp :noweb-ref cider
    (quse-package cider
                  :init
                  (setf cider-repl-tab-command 'indent-for-tab-command)
                  (setf cider-default-repl-command "boot"))
  #+END_SRC

  CIDER can be integrated with Auto-Complete painlessly by using the ac-cider
  package.

  #+BEGIN_SRC emacs-lisp :noweb-ref ac-cider
    (quse-package ac-cider
                  :init
                  (add-hook 'cider-mode-hook 'ac-cider-setup)
                  (add-hook 'cider-mode-hook 'ac-flyspell-workaround)
                  (add-hook 'cider-repl-mode-hook 'ac-cider-setup)
                  (add-hook 'cider-repl-mode-hook 'ac-flyspell-workaround)
                  (add-hook 'cider-clojure-interaction-mode-hook 'ac-cider-setup)
                  (add-hook 'cider-clojure-interaction-mode-hook 'ac-flyspell-workaround)
                  (eval-after-load "auto-complete"
                    '(progn
                       (add-to-list 'ac-modes 'cider-mode)
                       (add-to-list 'ac-modes 'cider-repl-mode)
                       (add-to-list 'ac-modes 'cider-clojure-interaction-mode))))
  #+END_SRC

* Hack with Common Lisp.

  While most of my Lisp-writing has been in Clojure, the majority of my
  Lisp-learning has been in Common Lisp. Fanboys say there's nothing you can't
  do with CL, and, while I don't have enough experience to confirm or deny
  this, I always enjoy exploring the language. The Emacs/CL ecosystem is
  amazing as well.

  SLIME is indescribably good. 'Nuff said. As for the configuration, I set SBCL
  as my preferred Lisp, and tell SLIME to look fancy. In addition, I tell SLIME
  where to find the Common Lisp Hyperspec so I can look up HTML documentation
  on the fly.

  #+BEGIN_SRC emacs-lisp :noweb-ref slime
    (quse-package slime
                  :init
                  (setf inferior-lisp-program "sbcl")
                  (setf common-lisp-hyperspec-root (getenv "HYPERSPEC_ROOT"))
                  (setf slime-contribs '(slime-fancy))
                  (slime-setup))
  #+END_SRC

  Integrating Auto-Complete and SLIME is painless, thanks to the work of Steve
  Purcell.

  #+BEGIN_SRC emacs-lisp :noweb-ref ac-slime
    (quse-package ac-slime
                  :init
                  (add-hook 'slime-mode-hook 'set-up-slime-ac)
                  (add-hook 'slime-repl-mode-hook 'set-up-slime-ac)
                  (eval-after-load "auto-complete"
                    '(add-to-list 'ac-modes 'slime-repl-mode)))
  #+END_SRC

* Edit web applications.

  Managing modes to edit the dozens of new file formats for a new web project
  every month is a nightmare. So much so I don't like to talk about it. I've
  found that =web-mode.el= does a pretty good job of managing them
  automagically. I use the version from which I sometimes submit pull
  requests. Setting ~web-mode-enable-engine-detection~ allows the mode to pick
  up on ~-*-~-style comments at the top of files.

  #+BEGIN_SRC emacs-lisp :noweb-ref web-mode
    (quse-package web-mode
                  :init
                  (setf web-mode-enable-engine-detection t)
                  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
                  (add-to-list 'org-src-lang-modes '("html" . web))
                  (add-to-list 'auto-mode-alist '("\\.css\\'" . web-mode))
                  (add-to-list 'org-src-lang-modes '("css" . web))
                  (add-to-list 'auto-mode-alist '("\\.js\\'" . web-mode))
                  (add-to-list 'auto-mode-alist '("\\.json\\'" . web-mode))
                  (add-to-list 'org-src-lang-modes '("js" . web))
                  (add-to-list 'auto-mode-alist '("\\.php\\'" . web-mode))
                  (add-to-list 'auto-mode-alist '("\\.tmpl\\'" . web-mode)))
  #+END_SRC

  =web-mode= takes care of Javascript, but isn't able to provide a full set of
  completion features for the language. Tern is a widely-used and featureful JS
  completion framework. It is easily installable on Emacs and can be forced to
  work with =web-mode= by modifying a few hooks and forcing some special files
  to be opened in JSON mode.

  #+BEGIN_SRC emacs-lisp :noweb-ref tern
    (quse-package tern
                  :config
                  (setf tern-command '("tern"))
                  (add-hook 'web-mode-hook 'tern-mode)
                  (add-to-list 'auto-mode-alist '(".tern-project" . web-mode))
                  (add-to-list 'web-mode-content-types '("json" . ".tern-project")))
    (quse-package tern-auto-complete :config (tern-ac-setup))
  #+END_SRC

** Edit CoffeeScript (maybe).

   CoffeeScript is a light version of Javascript inspired by Python's syntax,
   which makes me like it automatically. In addition, a further variation,
   IcedCoffeeScript, makes a point of using continuation-passing style, which I
   find really fun to think about, especially in JavaScript. I may never end up
   using either for serious work, but just in case here's the mode
   installation.

   #+BEGIN_SRC emacs-lisp :noweb-ref coffee-mode
     (quse-package coffee-mode)
   #+END_SRC

* Steal Java-editing features from Eclipse.

  Trying to edit Java with just Emacs is a nightmare. I tried it for a while,
  but eventually caved into practicality and installed Eclipse, eclim, and
  =emacs-eclim=. The trio of software packages work together to use Eclipse's
  editing features and completion in Emacs. The configuration here comes
  straight from the =emacs-eclim= website, converted to a slightly strange form
  because of the project's package structure.

  #+BEGIN_SRC emacs-lisp :noweb-ref emacs-eclim
    (quelpa 'emacs-eclim)
    (use-package eclim :config (global-eclim-mode))
    (use-package eclimd :config (setf eclimd-wait-for-process nil))
    (use-package ac-emacs-eclim-source :config (ac-emacs-eclim-config))
  #+END_SRC

** Include YASnippet.

   Some features of =emacs-eclim= depend on having YASnippet, a popular Emacs
   snippet package, installed. I don't use YASnippet directly, only through
   =emacs-eclim=, but I may change my mind in the future.

   #+BEGIN_SRC emacs-lisp :noweb-ref yasnippet
     (quse-package yasnippet)
   #+END_SRC

* Edit and complete Nim.

  Nim is a systems programming languages that compiles to C, C++, ObjC, and
  JavaScript. It's the latest toy language I am trying to learn.

  #+BEGIN_SRC emacs-lisp :noweb-ref nim-mode
    (quse-package nim-mode)
  #+END_SRC

* View Markdown.

  I prefer Org to Markdown in every situation, but sometimes it is necessary to
  be able to read Markdown. Good thing there's a mode on MELPA!

  #+BEGIN_SRC emacs-lisp :noweb-ref markdown-mode
    (quse-package markdown-mode)
  #+END_SRC

* Edit and complete Go.

  I have fun with Go, and it's as simple as that :-). Its tooling for Emacs
  follows the theme of the rest of the tooling I use: It's simple and easy to
  install.

  #+BEGIN_SRC emacs-lisp :noweb-ref go-mode
    (quse-package go-mode
                  :init
                  (add-hook 'before-save-hook #'gofmt-before-save)
                  :bind (:map go-mode-map
                              ("M-." . godef-jump)))
  #+END_SRC

  #+BEGIN_SRC emacs-lisp :noweb-ref go-autocomplete
    (quse-package go-autocomplete)
  #+END_SRC

* Edit Protocol Buffer files.

  Google's Protocol Buffers are a data exchange format useful for quick
  over-the-wire messages. The canonical implementation comes with a major mode
  for editing a Protocol Buffer definition.

  #+BEGIN_SRC emacs-lisp :noweb-ref protobuf-mode
    (quse-package (protobuf-mode :fetcher github
                                 :repo "google/protobuf"
                                 :files ("editors/protobuf-mode.el")))
  #+END_SRC

* YAML.

  "Yet Another Markup Language" indeed. It's the wrong acronym. Sue me. Ugh.

  #+BEGIN_SRC emacs-lisp :noweb-ref yaml-mode
    (quse-package yaml-mode)
  #+END_SRC

