init.el

(quse-package projectile
              :init
              (projectile-global-mode)
              (setf projectile-switch-project-action 'projectile-dired)
              (setf projectile-indexing-method 'alien))

(quse-package magit)

(quse-package ssh-agency)

(quse-package auto-complete
              :init
              (require 'auto-complete-config)
              (ac-config-default))

(quse-package cider
              :init
              (setf cider-repl-tab-command 'indent-for-tab-command)
              (setf cider-default-repl-command "boot"))

(quse-package ac-cider
              :init
              (add-hook 'cider-mode-hook 'ac-cider-setup)
              (add-hook 'cider-mode-hook 'ac-flyspell-workaround)
              (add-hook 'cider-repl-mode-hook 'ac-cider-setup)
              (add-hook 'cider-repl-mode-hook 'ac-flyspell-workaround)
              (add-hook 'cider-clojure-interaction-mode-hook 'ac-cider-setup)
              (add-hook 'cider-clojure-interaction-mode-hook 'ac-flyspell-workaround)
              (eval-after-load "auto-complete"
                '(progn
                   (add-to-list 'ac-modes 'cider-mode)
                   (add-to-list 'ac-modes 'cider-repl-mode)
                   (add-to-list 'ac-modes 'cider-clojure-interaction-mode))))

(quse-package slime
              :init
              (setf inferior-lisp-program "sbcl")
              (setf common-lisp-hyperspec-root (getenv "HYPERSPEC_ROOT"))
              (setf slime-contribs '(slime-fancy))
              (slime-setup))

(quse-package ac-slime
              :init
              (add-hook 'slime-mode-hook 'set-up-slime-ac)
              (add-hook 'slime-repl-mode-hook 'set-up-slime-ac)
              (eval-after-load "auto-complete"
                '(add-to-list 'ac-modes 'slime-repl-mode)))

(quse-package web-mode
              :init
              (setf web-mode-enable-engine-detection t)
              (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
              (add-to-list 'org-src-lang-modes '("html" . web))
              (add-to-list 'auto-mode-alist '("\\.css\\'" . web-mode))
              (add-to-list 'org-src-lang-modes '("css" . web))
              (add-to-list 'auto-mode-alist '("\\.js\\'" . web-mode))
              (add-to-list 'auto-mode-alist '("\\.json\\'" . web-mode))
              (add-to-list 'org-src-lang-modes '("js" . web))
              (add-to-list 'auto-mode-alist '("\\.php\\'" . web-mode))
              (add-to-list 'auto-mode-alist '("\\.tmpl\\'" . web-mode)))

(quse-package tern
              :config
              (setf tern-command '("tern"))
              (add-hook 'web-mode-hook 'tern-mode)
              (add-to-list 'auto-mode-alist '(".tern-project" . web-mode))
              (add-to-list 'web-mode-content-types '("json" . ".tern-project")))
(quse-package tern-auto-complete :config (tern-ac-setup))

(quse-package coffee-mode)

(quelpa 'emacs-eclim)
(use-package eclim :config (global-eclim-mode))
(use-package eclimd :config (setf eclimd-wait-for-process nil))
(use-package ac-emacs-eclim-source :config (ac-emacs-eclim-config))

(quse-package yasnippet)

(quse-package nim-mode)

(quse-package markdown-mode)

(quse-package go-mode
              :init
              (add-hook 'before-save-hook #'gofmt-before-save)
              :bind (:map go-mode-map
                          ("M-." . godef-jump)))

(quse-package go-autocomplete)

(quse-package (protobuf-mode :fetcher github
                             :repo "google/protobuf"
                             :files ("editors/protobuf-mode.el")))

(quse-package yaml-mode)
