dot-emacs-dot-d.org
* Edit and complete Python.

  There are quite a few options for this in Emacs. The one I have found to be
  the most useful personally is Jedi, which is relatively minimal as full
  language environments go. It hooks up to a Python component which must be
  installed separately. The following snippet is the minimal Jedi setup taken
  from Jedi's own documentation. I choose to override Emacs jump-to shortcuts
  with Jedi's.

  #+BEGIN_SRC emacs-lisp :noweb-ref jedi
    (quse-package jedi
                  :init
                  (add-hook 'python-mode-hook 'jedi:setup)
                  (setf jedi:complete-on-dot t)
                  (setf jedi:use-shortcuts t))
  #+END_SRC

  Unfortunately, Jedi does not handle virtual environments by itself, so we
  need to install and configure the =virtualenvwrapper.el= package for
  everything to work properly.

  #+BEGIN_SRC emacs-lisp :noweb-ref virtualenvwrapper
    (quse-package virtualenvwrapper
                  :init
                  (venv-initialize-interactive-shells)
                  (venv-initialize-eshell))
  #+END_SRC

  Unfortunatelier, =virtualenvwrapper.el= seems to not respect the global
  "directory for virtualenvs" setting, while Jedi does. They end up being in
  different places. Ostensibly, the default for =virtualenvwrapper.el= is
  =~/.virtualenvs=, but since I've been bitten enough by edge cases around
  virtualenvs already, I set both variables here. Worse still, this block has
  to go before both of the preceding snippets to work properly. There has to be
  a way to do this with ~use-package~, but w/e I'm running on 0 sleep.

  #+BEGIN_SRC emacs-lisp :noweb-ref venv-location
    (let ((global-venv-location "~/.virtualenvs"))
      (setf python-environment-directory global-venv-location)
      (setf venv-location global-venv-location))
  #+END_SRC

* Edit Hoon files.

  Hoon is a somewhat esoteric programming language created and used on the
  functional Urbit operating system. The Urbit distribution contains an Emacs
  mode.

  #+BEGIN_SRC emacs-lisp :noweb-ref hoon-mode
    (quse-package (hoon-mode :fetcher github
                             :repo "urbit/urbit"
                             :files ("extras/hoon-mode.el/hoon-mode.el")))
  #+END_SRC

* Edit GDScript files.

  The Godot game engine uses a Python-like scripting language. Their built-in
  editor is not the greatest, so why not use Emacs to edit scripts instead?

  #+BEGIN_SRC emacs-lisp :noweb-ref gdscript-mode
    (quse-package (gdscript-mode :fetcher github
                                 :repo "akoaysigod/gdscript-mode"))
  #+END_SRC

* Create and control Docker containers.

  Short and uninsteresting story: I used to shun containers, thinking that they
  were just a passing trend. I may be wrong, but using them changed my
  mind. Two packages, Spotify's =dockerfile-mode= and Silex's =docker.el=,
  allow Emacs to edit Dockerfiles and control docker operations, respectively.

  #+BEGIN_SRC emacs-lisp :noweb-ref docker
    (quse-package dockerfile-mode :init (add-to-list
                                         'auto-mode-alist
                                         '("Dockerfile\\'" . dockerfile-mode)))

    (quse-package docker :init (docker-global-mode))
  #+END_SRC

* Make Emacs and .NET cooperate.

  There is a complete and up-to-date major mode for C#, the only the .NET
  language I use at the moment, on MELPA.

  #+BEGIN_SRC emacs-lisp :noweb-ref csharp-mode
    (quse-package csharp-mode)
  #+END_SRC

  OmniSharp is a project which provides integration with .NET's introspection
  libraries to tools other than Visual Studio. I've had a lot of problems
  installing the server component, but the Emacs mode is easy to install and
  add to the C# mode's hook.

  #+BEGIN_SRC emacs-lisp :noweb-ref omnisharp
    (quse-package omnisharp :init (add-hook 'csharp-mode-hook 'omnisharp-mode))
  #+END_SRC

* Edit Lua.

  Lua-mode is a simple major mode for the Lua programming language which
  includes, highlighting, indentation, and send-to-REPL.

  #+BEGIN_SRC emacs-lisp :noweb-ref lua-mode
    (quse-package lua-mode)
  #+END_SRC

* Tangle source code.

  All files get tangled to the directory that this file is in.

** =init.el=

   #+BEGIN_SRC emacs-lisp :tangle init.el
     <<quelpa>>

     <<use-package>>

     <<quse-package>>

     <<better-defaults>>

     <<save-place-mode>>

     <<ido-really-everywhere>>

     <<fill-column>>

     <<prefer-coding-system>>

     <<inhibit-splash-screen>>

     <<undo-tree>>

     <<powerline>>

     <<moe-theme>>

     <<face-attribute-font>>

     <<smartparens>>

     <<dired-dwim-target>>

     <<org>>

     <<ox-reveal>>

     <<org-pdf-latexmk>>

     <<org-latex-classes-apa6>>

     <<ledger-mode>>

     <<password-store>>

     <<projectile>>

     <<magit>>

     <<ssh-agency>>

     <<auto-complete>>

     <<cider>>

     <<ac-cider>>

     <<slime>>

     <<ac-slime>>

     <<web-mode>>

     <<tern>>

     <<coffee-mode>>

     <<emacs-eclim>>

     <<yasnippet>>

     <<nim-mode>>

     <<markdown-mode>>

     <<go-mode>>

     <<go-autocomplete>>

     <<protobuf-mode>>

     <<yaml-mode>>

     <<venv-location>>

     <<jedi>>

     <<virtualenvwrapper>>

     <<hoon-mode>>

     <<gdscript-mode>>

     <<docker>>

     <<csharp-mode>>

     <<omnisharp>>

     <<lua-mode>>
   #+END_SRC
