init.el

(let ((global-venv-location "~/.virtualenvs"))
  (setf python-environment-directory global-venv-location)
  (setf venv-location global-venv-location))

(quse-package jedi
              :init
              (add-hook 'python-mode-hook 'jedi:setup)
              (setf jedi:complete-on-dot t)
              (setf jedi:use-shortcuts t))

(quse-package virtualenvwrapper
              :init
              (venv-initialize-interactive-shells)
              (venv-initialize-eshell))

(quse-package (hoon-mode :fetcher github
                         :repo "urbit/urbit"
                         :files ("extras/hoon-mode.el/hoon-mode.el")))

(quse-package (gdscript-mode :fetcher github
                             :repo "akoaysigod/gdscript-mode"))

(quse-package dockerfile-mode :init (add-to-list
                                     'auto-mode-alist
                                     '("Dockerfile\\'" . dockerfile-mode)))

(quse-package docker :init (docker-global-mode))
(quse-package docker-tramp)

(quse-package csharp-mode)

(quse-package omnisharp :init (add-hook 'csharp-mode-hook 'omnisharp-mode))

(quse-package lua-mode)
